[
    {"link": "https://en.wikipedia.org/wiki/Dog", "header": "Dog - Wikipedia", "bodyText": "The dog or domestic dog is a domesticated descendant of the grey wolf. It has many notable characteristics, the most prominent of which is the upturning tail."},
    {"link": "https://www.dogstrust.org.uk/", "header": "Dogs Trust: Dogs Rehoming & Dog Rescue Charity", "bodyText": "Dogs Trust is the UK's largest Dog Welfare Charity. Looking to rehome a rescue dog or to donate to an animal charity? Visit us today to find out more!"},
    {"link": "http://www.vetstreet.com/dogs/", "header": "Complete Guide to Caring for Dogs - Vetstreet", "bodyText": "Your dog's online owners manual, featuring articles about breed information, dog selection, training, grooming and care for dogs and puppies."},
    {"link": "https://dogtime.com/dog-breeds/profiles", "header": "All Dog Breeds - Complete List of Dog Profiles - DogTime", "bodyText": "Detailed profiles of more than 200 dog breeds. Includes personality, history, dog pictures, dog health info, and more. Find the dog breed that is right for ..."},
    {"link": "https://www.rspca.org.uk/adviceandwelfare/pets/dogs", "header": "Dog Care Advice, Tips & Health Information | RSPCA", "bodyText": "Give a home to a rescued dog. We rescue and rehome thousands of dogs each year - each one comes with a unique personality ready made. If you're looking to ..."},
    {"link": "https://www.scotsman.com/lifestyle/family-and-parenting/here-are-10-of-the-most-cuddly-and-affectionate-breeds-of-dog-that-always-want-to-snuggle-in-3318654", "header": "Here are 10 of the most cuddly and affectionate breeds of dog ...", "bodyText": "However if you are simply looking for a dog that will be a loyal and loving pet, content to curl up with you on the sofa for the night, then ..."},
    {"link": "https://www.nationalgeographic.com/animals/mammals/facts/domestic-dog", "header": "Dog, facts and photos - National Geographic", "bodyText": "The term “domestic dog” refers to any of several hundred breeds of dog in the world today. While these animals vary drastically in appearance, ..."},
    {"link": "https://www.dailypaws.com/dogs-puppies/dog-breeds", "header": "Dog Breed Information, Groups, and Photos | Daily Paws", "bodyText": "Get information on the different dog breeds and groups. Find out more about dog breed physical appearances, personality types, and more."},
    {"link": "https://twitter.com/dog_feelings", "header": "Thoughts of Dog® (@dog_feelings) | Twitter", "bodyText": "The latest Tweets from Thoughts of Dog® (@dog_feelings): \"sometimes. the human presses their noggin against mine. to figure out what i'm thinking. so i just ..."},
    {"link": "https://www.petsathome.com/shop/en/pets/dog", "header": "Dog Supplies | Food, Toys, Collars & Care | Pets at Home", "bodyText": "Keep your furry best friend healthy, happy and full of life! Shop our dog supplies for everything that a dog will ever need. Free delivery on orders over ..."}
]