[
    {"link": "https://en.wikipedia.org/wiki/Dog", "header": "Dog - Wikipedia", "bodyText": "The dog or domestic dog is a domesticated descendant of the grey wolf. It has many notable characteristics, the most prominent of which is the upturning tail."},
    {"link": "https://www.dogstrust.org.uk/", "header": "Dogs Trust: Dogs Rehoming & Dog Rescue Charity", "bodyText": "Dogs Trust is the UK's largest Dog Welfare Charity. Looking to rehome a rescue dog or to donate to an animal charity? Visit us today to find out more!"},
    {"link": "http://www.vetstreet.com/dogs/", "header": "Complete Guide to Caring for Dogs - Vetstreet", "bodyText": "Your dog's online owners manual, featuring articles about breed information, dog selection, training, grooming and care for dogs and puppies."},
    {"link": "https://dogtime.com/dog-breeds/profiles", "header": "All Dog Breeds - Complete List of Dog Profiles - DogTime", "bodyText": "Detailed profiles of more than 200 dog breeds. Includes personality, history, dog pictures, dog health info, and more. Find the dog breed that is right for ..."},
    {"link": "https://www.rspca.org.uk/adviceandwelfare/pets/dogs", "header": "Dog Care Advice, Tips & Health Information | RSPCA", "bodyText": "Give a home to a rescued dog. We rescue and rehome thousands of dogs each year - each one comes with a unique personality ready made. If you're looking to ..."},
    {"link": "https://www.scotsman.com/lifestyle/family-and-parenting/here-are-10-of-the-most-cuddly-and-affectionate-breeds-of-dog-that-always-want-to-snuggle-in-3318654", "header": "Here are 10 of the most cuddly and affectionate breeds of dog ...", "bodyText": "However if you are simply looking for a dog that will be a loyal and loving pet, content to curl up with you on the sofa for the night, then ..."},
    {"link": "https://www.nationalgeographic.com/animals/mammals/facts/domestic-dog", "header": "Dog, facts and photos - National Geographic", "bodyText": "The term “domestic dog” refers to any of several hundred breeds of dog in the world today. While these animals vary drastically in appearance, ..."},
    {"link": "https://www.dailypaws.com/dogs-puppies/dog-breeds", "header": "Dog Breed Information, Groups, and Photos | Daily Paws", "bodyText": "Get information on the different dog breeds and groups. Find out more about dog breed physical appearances, personality types, and more."},
    {"link": "https://twitter.com/dog_feelings", "header": "Thoughts of Dog® (@dog_feelings) | Twitter", "bodyText": "The latest Tweets from Thoughts of Dog® (@dog_feelings): \"sometimes. the human presses their noggin against mine. to figure out what i'm thinking. so i just ..."},
    {"link": "https://www.petsathome.com/shop/en/pets/dog", "header": "Dog Supplies | Food, Toys, Collars & Care | Pets at Home", "bodyText": "Keep your furry best friend healthy, happy and full of life! Shop our dog supplies for everything that a dog will ever need. Free delivery on orders over ..."},
    {"link": "https://en.wikipedia.org/wiki/Cat", "header": "Cat - Wikipedia", "bodyText": "The cat (Felis catus) is a domestic species of small carnivorous mammal. It is the only domesticated species in the family Felidae and is often referred to ..."},
    {"link": "https://www.britannica.com/animal/cat", "header": "cat | Breeds & Facts | Britannica", "bodyText": "Cat, domesticated member of the family Felidae, order Carnivora, and the smallest member of that family. Like all felids, cats are characterized by supple ..."},
    {"link": "https://www.cats.org.uk/adopt-a-cat/choosing-a-cat", "header": "Choosing a Cat - Make the Right Choice For You", "bodyText": "Whether you're a lifelong cat-lover or embracing the idea of a new pet, getting a new cat or kitten is a great experience. At Cats Protection, we believe in ..."},
    {"link": "https://www.nationalgeographic.com/animals/mammals/facts/domestic-cat", "header": "Cat | National Geographic", "bodyText": "Domestic Cat · Relationship with Humans. Felis catus has had a very long relationship with humans. · Hunting Abilities. Like their wild relatives, domestic cats ..."},
    {"link": "https://www.rspca.org.uk/adviceandwelfare/pets/cats", "header": "Cat Care Tips, Advice & Health Information | RSPCA", "bodyText": "Eating meat is important for cats; they cannot survive without the nutrients found in animal-derived materials. Cats love cat naps! Domestic cats sleep for 12- ..."},
    {"link": "https://www.aspca.org/pet-care/cat-care/general-cat-care", "header": "General Cat Care | ASPCA", "bodyText": "If you are considering adopting a cat, please visit your local shelter. We encourage you to browse our directory of adoptable cats in your area, or use our ..."},
    {"link": "http://www.vetstreet.com/cats/", "header": "Complete Guide to Caring for Cats - Vetstreet", "bodyText": "Your cat's online owners manual, featuring articles about breed information, cat selection, training, grooming and care for cats and kittens."},
    {"link": "https://en.wikipedia.org/wiki/NGC_6946", "header": "NGC 6946 - Wikipedia", "bodyText": "NGC 6946, sometimes referred to as the Fireworks Galaxy, is a face-on intermediate spiral galaxy with a small bright nucleus, whose location in the sky ..."},
    {"link": "https://www.nasa.gov/image-feature/goddard/2021/hubble-views-a-dazzling-fireworks-galaxy", "header": "Hubble Views a Dazzling 'Fireworks Galaxy' | NASAHubble Views a Dazzling 'Fireworks Galaxy' | NASA", "bodyText": "The galaxy NGC 6946 is nothing short of spectacular. In the last century alone, NGC 6946 has experienced 10 observed supernovae, ..."},
    {"link": "https://arxiv.org/abs/1903.01318", "header": "A New, Larger Sample of Supernova Remnants in NGC 6946", "bodyText": "Abstract: The relatively nearby spiral galaxy NGC~6946 is one of the most actively star forming galaxies in the local Universe."},
    {"link": "https://en.wikipedia.org/wiki/NGC_6302", "header": "NGC 6302 - Wikipedia", "bodyText": "NGC 6302 is a bipolar planetary nebula in the constellation Scorpius. The structure in the nebula is among the most complex ever observed in planetary ..."},
    {"link": "https://www.nasa.gov/mission_pages/hubble/multimedia/ero/ero_ngc6302.html", "header": "NGC 6302 - NASA", "bodyText": "This celestial object looks like a delicate butterfly. But it is far from serene. What resemble dainty butterfly wings are actually roiling ..."},
    {"link": "https://hubblesite.org/contents/media/images/2020/31/4680-Image?keyword=Nebulas", "header": "NGC 6302: The \"Butterfly Nebula\" - Hubble Space Telescope", "bodyText": "Hubble was recently retrained on NGC 6302, known as the \"Butterfly Nebula,\" to observe it across a more complete spectrum of light, ..."},
    {"link": "https://www.eso.org/public/images/eso9820d/", "header": "Fine structure in NGC 6302 | ESO - European Southern ...", "bodyText": "This splendid colour image of a famous southern Planetary Nebula, NGC 6302 or the Bug Nebula (sometimes nicknames the Butterfly Nebula), was obtained by ..."}
]